app/Controllers/Home.php

    public function eliminarNoticia($id)
    {
        $db = \Config\Database::connect();

        // Eliminar la noticia con el ID proporcionado
        $db->table('noticias')->where('id', $id)->delete();
---
DELETE FROM "noticias"
WHERE "id" = '1'

    public function agregarDato()
{
    $data = $this->request->getJSON(true); // Obtener los datos enviados en la solicitud POST en formato JSON

    // Lógica para agregar los datos a la base de datos
    $db = \Config\Database::connect();
    $db->table('noticias')->set($data)->insert();
---
INSERT INTO "noticias" ("id", "titulo", "contenido", "fecha", "fuente", "url") VALUES ('1', 'Título de la nueva noticia', 'Contenido de la nueva noticia', '2023-07-11', 'Cronica', 'https://cronica.com.ec/2023/07/06/mas-de-40-descargas-de-agua-contaminada-llegan-a-los-rios-malacatos-y-zamora/')